
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |       18 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                                |
|:--------:|:---------------------------------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner.module.record_metric.aws_cloudwatch_event_rule.run_every`                         |
|    🟢    | `module.actions-runner.module.record_metric.aws_cloudwatch_event_target.lambda_target`                   |
|    🟢    | `module.actions-runner.module.record_metric.aws_cloudwatch_log_group.lambda`                             |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_policy.lambda_logging`                               |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_logs`                  |
|    🟢    | `module.actions-runner.module.record_metric.aws_lambda_function.lambda`                                  |
|    🟢    | `module.actions-runner.module.record_metric.aws_lambda_function_event_invoke_config.update_filter`       |
|    🟢    | `module.actions-runner.module.record_metric.aws_lambda_permission.allow_eventbridge`                     |
|    🟢    | `module.actions-runner.module.record_metric.aws_s3_object.lambda_package`                                |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_rule.run_every`                   |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_target.lambda_target`             |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_log_group.lambda`                       |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_logging`                         |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_logs`            |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda`                            |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_lambda_function_event_invoke_config.update_filter` |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_lambda_permission.allow_eventbridge`               |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package`                          |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.module.record_metric.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_event_rule.run_every will be created
  + resource "aws_cloudwatch_event_rule" "run_every" {
      + arn                 = (known after apply)
      + description         = "Trigger Lambda record_metric_actions-runner-20250505203133108100000007-INx3ry every minute"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = (known after apply)
      + name_prefix         = "actions-runner-20250505203133108100000"
      + schedule_expression = "rate(1 minute)"
      + tags                = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all            = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "send-to-lambda"
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/record_metric_actions-runner-20250505203133108100000007-INx3ry"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all          = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.record_metric.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda record_metric_actions-runner-20250505203133108100000007-INx3ry"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "infrahouse-registration20250505214430567900000006"
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "record_metric_actions-runner-20250505203133108100000007-INx3ry"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::303467602807:role/infrahouse-registration20250505214430567900000006"
      + runtime                        = "python3.12"
      + s3_bucket                      = "infrahouse-action-runner-lambda-20250505203126570200000001"
      + s3_key                         = "ca8c4283-59ba-1241-a9f3-75d742145f48.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                       = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ASG_NAME"           = "actions-runner-20250505203133108100000007-INx3ry"
              + "GH_APP_ID"          = "1016363"
              + "GITHUB_ORG_NAME"    = "infrahouse"
              + "GITHUB_SECRET"      = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              + "GITHUB_SECRET_TYPE" = "pem"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_lambda_function_event_invoke_config.update_filter will be created
  + resource "aws_lambda_function_event_invoke_config" "update_filter" {
      + function_name          = "record_metric_actions-runner-20250505203133108100000007-INx3ry"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner.module.record_metric.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "record_metric_actions-runner-20250505203133108100000007-INx3ry"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "infrahouse-action-runner-lambda-20250505203126570200000001"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "ca8c4283-59ba-1241-a9f3-75d742145f48.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = ".terraform/modules/actions-runner/modules/record_metric/ca8c4283-59ba-1241-a9f3-75d742145f48.zip"
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_rule.run_every will be created
  + resource "aws_cloudwatch_event_rule" "run_every" {
      + arn                 = (known after apply)
      + description         = "Trigger Lambda record_metric_actions-runner-20250505203133193000000009-KWX4No every minute"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = (known after apply)
      + name_prefix         = "actions-runner-20250505203133193000000"
      + schedule_expression = "rate(1 minute)"
      + tags                = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all            = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "send-to-lambda"
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/record_metric_actions-runner-20250505203133193000000009-KWX4No"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all          = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda record_metric_actions-runner-20250505203133193000000009-KWX4No"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "infrahouse-registration20250505214308709200000002"
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "record_metric_actions-runner-20250505203133193000000009-KWX4No"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::303467602807:role/infrahouse-registration20250505214308709200000002"
      + runtime                        = "python3.12"
      + s3_bucket                      = "infrahouse-action-runner-lambda-20250505203126845000000003"
      + s3_key                         = "b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                       = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ASG_NAME"           = "actions-runner-20250505203133193000000009-KWX4No"
              + "GH_APP_ID"          = "1016363"
              + "GITHUB_ORG_NAME"    = "infrahouse"
              + "GITHUB_SECRET"      = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              + "GITHUB_SECRET_TYPE" = "pem"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function_event_invoke_config.update_filter will be created
  + resource "aws_lambda_function_event_invoke_config" "update_filter" {
      + function_name          = "record_metric_actions-runner-20250505203133193000000009-KWX4No"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "record_metric_actions-runner-20250505203133193000000009-KWX4No"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "infrahouse-action-runner-lambda-20250505203126845000000003"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = ".terraform/modules/actions-runner-noble/modules/record_metric/b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0.zip"
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDE4LCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAwfX0=
```
</details>